app/views/lessons/show.html.erb


<h3><%= @lesson.attendances.count %>人が参加予定です</h3>
---
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."lesson_id" = ?  [["lesson_id", 1]]