app/views/items/liked_users.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."item_id" = ?  [["item_id", 8]]
---
<h1>いいねしたユーザー</h1>
<%= @item.likes.count %>人のユーザーがいいねしています