app/views/items/show.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."item_id" = ?  [["item_id", 8]]
---
				<% end %>
				<p><%= link_to @item.likes.count, liked_users_path(@item) %>人がいいねをしています</p>

SELECT COUNT(*) FROM "likes" WHERE "likes"."item_id" = ?  [["item_id", 6]]
---
					<% end %>
					<p><%= link_to @item.likes.count, liked_users_path(@item) %>人がいいねをしています</p>