app/controllers/attendances_controller.rb

INSERT INTO "attendances" ("lesson_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["lesson_id", 1], ["user_id", 1], ["created_at", "2019-08-06 07:51:37.892419"], ["updated_at", "2019-08-06 07:51:37.892419"]]
---
	def create
		@attendance = current_user.attendances.create(lesson_id: params[:lesson_id])