app/controllers/items_controller.rb

	def purchase_index
		@items = Item.all
---
SELECT "items".* FROM "items"

	def create
		@item = Item.new(item_params)
		@item.user = current_user
		if @item.save
---
INSERT INTO "items" ("user_id", "category_name", "item_name", "length", "weight", "grip", "face", "body", "created_at", "updated_at", "item_image_id", "color", "price", "stock") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def liked_users
		@item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

	def update
		@item = Item.find(params[:id])
		@item.user = current_user
		if @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "items" SET "item_image_id" = ?, "item_name" = ?, "category_name" = ?, "length" = ?, "weight" = ?, "grip" = ?, "face" = ?, "color" = ?, "body" = ?, "updated_at" = ? WHERE "items"."id" = ?

	def purchase
		@item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

	def purchase_confirm
		@item = Item.find(params[:id])
		@item.update(purchase: true, purchased_at: Time.current)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "items" SET "purchase" = ?, "purchased_at" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["purchase", 1], ["purchased_at", "2019-08-11 10:36:08.910060"], ["updated_at", "2019-08-11 10:36:08.917605"], ["id", 5]]

	def complete
		@item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]