app/controllers/items_controller.rb

	def destroy
		@item = Item.find(params[:id])
		@item.destroy
---
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 2]]