app/controllers/lessons_controller.rb

	def create
		@lesson = Lesson.new(lesson_params)
		#エラーメッセージでよく"User must exist"と出るが下記に追記が問題
		#@lesson.user_id に current_user.id 　を"代入"することでどのユーザーが投稿したのか判別できる
		#だから == にしてはいけない
		@lesson.user = current_user
		if @lesson.save
---
INSERT INTO "lessons" ("user_id", "lesson_name", "location", "time", "entry_count", "over_view", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def index
		@lessons = Lesson.all
---
SELECT "lessons".* FROM "lessons"

	def show
		@lesson = Lesson.find(params[:id])
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		@lesson = Lesson.find(params[:id])
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

	def update
		@lesson = Lesson.find(params[:id])
		@lesson.user == current_user
		if @lesson.update(lesson_params)
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "lessons" SET "lesson_name" = ?, "location" = ?, "time" = ?, "entry_count" = ?, "over_view" = ?, "updated_at" = ? WHERE "lessons"."id" = ?  [["lesson_name", "編集"], ["location", "編集"], ["time", "編集"], ["entry_count", 100], ["over_view", "編集！"], ["updated_at", "2019-08-07 06:41:33.228531"], ["id", 3]]

	def destroy
		@lesson = Lesson.find(params[:id])
		@lesson.destroy
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "lessons" WHERE "lessons"."id" = ?  [["id", 3]]