app/controllers/likes_controller.rb

INSERT INTO "likes" ("item_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["item_id", 8], ["user_id", 1], ["created_at", "2019-08-13 05:57:47.735219"], ["updated_at", "2019-08-13 05:57:47.735219"]]
---
	def create
		@like = current_user.likes.create(item_id: params[:item_id])

SELECT  "likes".* FROM "likes" WHERE "likes"."item_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["item_id", 8], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
	def destroy
		@like = Like.find_by(item_id: params[:item_id], user_id: current_user.id)
		#likeテーブルのitem_idはURLのitem_idを参照、user_idはログイン中のidを参照
		@like.destroy