app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-08-05 08:41:32.196564"], ["updated_at", "2019-08-05 08:41:32.196564"]]
INSERT INTO "entries" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["room_id", 1], ["created_at", "2019-08-05 08:41:32.305006"], ["updated_at", "2019-08-05 08:41:32.305006"]]
INSERT INTO "entries" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["room_id", 1], ["created_at", "2019-08-05 08:41:32.366832"], ["updated_at", "2019-08-05 08:41:32.366832"]]
---
	def create
		@room = Room.create
		#ログイン中のユーザーroom_idの中には今作ったID,user_idにはログイン中のユーザーID
		@entry1 = Entry.create(:room_id => @room.id, :user_id => current_user.id)
		#ストロングパラメータをここで定義して、user_idとroom_idをいれる。
		@entry2 = Entry.create(params.require(:entry).permit(:user_id, :room_id).merge(:room_id => @room.id))

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."room_id" = ?  [["user_id", 1], ["room_id", 1]]
---
	def show
		@room = Room.find(params[:id])
		if Entry.where(:user_id => current_user.id, :room_id => @room.id).present?