app/controllers/users_controller.rb

	def update
		@user = User.find(params[:id])
		@user == current_user
		if @user.update(user_params)
---
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "5179bf317caa5cc251664c44efd43e758dffd3416c6dfb415a31485c90c4"], ["updated_at", "2019-08-05 02:58:29.594539"], ["id", 1]]