app/controllers/users_controller.rb

	def show
		@user = User.find(params[:id])
		#ここからDM機能
		#entryのユーザーIDとログイン中のユーザーID同じ
		@currentUserEntry = Entry.where(user_id: current_user.id)
		#entryのユーザーIDと詳細ページ上のユーザーID同じ
		@userEntry = Entry.where(user_id: @user.id)
		if @user.id == current_user.id
			#何も表示させない
		else
			@currentUserEntry.each do |cu|
				@userEntry.each do |u|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 2]]

	def update
		@user = User.find(params[:id])
		@user == current_user
		if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "postal_code" = ?, "address" = ?, "updated_at" = ? WHERE "users"."id" = ?